Revit 2024 API
ScheduleSheetInstance.Point Property
 Location on the sheet where the ScheduleInstance is placed (in sheet coordinates).
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Since: 2013
Syntax
C#
public XYZ Point { get; set; }
Visual Basic
Public Property Point As XYZ
	Get
	Set
Visual C++
public:
property XYZ^ Point {
	XYZ^ get ();
	void set (XYZ^ value);
}
Exceptions
Exception | Condition
Autodesk.Revit.Exceptions.ArgumentNullException |  When setting this property: A non-optional argument was null
Autodesk.Revit.Exceptions.InvalidOperationException |  When setting this property: This operation is prohibited for ScheduleInstances associated with revision schedules in titleblocks.
See Also
ScheduleSheetInstance Class
Autodesk.Revit.DB Namespace